{
  "science": [
    "What are the fundamental principles of scientific inquiry?",
    "How has our understanding of the universe evolved over time?",
    "What are the most promising areas of current scientific research?",
    "How do scientific theories become accepted in the scientific community?",
    "What is the relationship between science and technology?",
    "How do scientific discoveries impact society?",
    "What ethical considerations are important in scientific research?"
  ],
  "technology": [
    "How is artificial intelligence transforming industries?",
    "What are the most significant technological breakthroughs in recent years?",
    "How does blockchain technology work and what are its applications?",
    "What are the privacy implications of modern technology?",
    "How has the internet changed human communication?",
    "What is the future of robotics and automation?",
    "How does quantum computing differ from traditional computing?"
  ],
  "politics": [
    "What are the different political ideologies and how do they compare?",
    "How do democratic systems function around the world?",
    "What is the relationship between politics and economics?",
    "How do international organizations influence global politics?",
    "What factors affect voter behavior and election outcomes?",
    "How has political discourse evolved in the digital age?",
    "What is the role of media in shaping political narratives?"
  ],
  "gaming": [
    "How have video games evolved as an art form?",
    "What makes certain game mechanics more engaging than others?",
    "How do game developers balance challenge and accessibility?",
    "What is the cultural impact of gaming on society?",
    "How are virtual reality and augmented reality changing gaming?",
    "What psychological factors make games addictive?",
    "How has the business model of gaming changed over time?"
  ],
  "business": [
    "What characteristics define successful business leadership?",
    "How do economic cycles affect business strategy?",
    "What are the most effective approaches to organizational management?",
    "How has e-commerce transformed traditional retail?",
    "What role does innovation play in business competitiveness?",
    "How do businesses adapt to changing market conditions?",
    "What are the best practices for sustainable business growth?"
  ],
  "health": [
    "What are the social determinants of health?",
    "How has our understanding of nutrition evolved over time?",
    "What are the most promising advances in medical technology?",
    "How does lifestyle influence long-term health outcomes?",
    "What is the relationship between mental health and physical wellbeing?",
    "How do healthcare systems vary around the world?",
    "What are the challenges in addressing global health issues?"
  ],
  "general": [
    "What are the key concepts covered in this material?",
    "Can you provide a summary of the main ideas presented?",
    "What are the most important points to understand from this content?",
    "How would you explain this information to someone new to the topic?",
    "What are the practical applications of this knowledge?",
    "What questions remain unanswered based on this information?",
    "How does this information relate to current events or trends?"
  ]
}
